package com.maropiyo.reminderparrot.util

import kotlin.random.Random

/**
 * インコの名前をランダムに生成するユーティリティ
 */
object ParrotNameGenerator {

    private val adjectives = listOf(
        "さすらいの",
        "ちいさな", "おしゃべりな",
        "あかるい",
        "にぎやかな",
        "やんちゃな",
        "かわいい",
        "みずいろの",
        "きいろい",
        "みどりの",
        "あかい",
        "しろい",
        "くろい",
        "しあわせな",
        "げんきな",
        "たのしい",
        "おだやかな",
        "やさしい",
        "たくましい",
        "はずかしがりの",
        "ひょうきんな",
        "りこうな",
        "ゆうかんな",
        "のんきな",
        "おとなしい",
        "あまえんぼうの",
        "いたずらな",
        "ねむそうな",
        "わんぱくな",
        "きまぐれな",
        "ふしぎな",
        "まほうつかいの",
        "でんせつの",
        "うちゅうの",
        "そらとぶ",
        "にじいろの",
        "きらきらの",
        "ぴかぴかの",
        "ふわふわの",
        "もこもこの",
        "つやつやの",
        "すべすべの",
        "ひらひらの",
        "さわやかな",
        "さらさらの",
        "きびきびした",
        "てきぱきした",
        "のんびりした",
        "どきどきの",
        "わくわくの",
        "うきうきの",
        "おちついた",
        "ほっとした",
        "おどろいた",
        "よろこんだ",
        "にこにこの",
        "くすくすの",
        "ユニークな",
        "カラフルな",
        "にぎやかな",
        "わいわいの",
        "ちょこんとした",
        "ぷっくりした",
        "まんまるの",
        "まるまるとした",
        "ほっそりした",
        "のっぽの",
        "おおきな",
        "ちっちゃな",
        "ミニミニの"
    )

    /**
     * ランダムなインコの名前を生成する
     */
    fun generateRandomName(): String {
        val randomAdjective = adjectives[Random.nextInt(adjectives.size)]
        return randomAdjective + "インコ"
    }
}
